app/controllers/api/bookmarks_controller.rb

    def create
        @bookmark = Bookmark.new(bookmark_params)
        @bookmark.user_id = current_user.id

        if @bookmark.save
---
INSERT INTO "bookmarks" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 36], ["event_id", 46], ["created_at", "2020-04-15 14:01:34.280886"], ["updated_at", "2020-04-15 14:01:34.280886"]]

    def destroy
        @bookmark = Bookmark.find(params[:id])
        if @bookmark && @bookmark.destroy
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 4]]