app/controllers/api/events_controller.rb

INSERT INTO "events" ("owner_id", "category", "title", "description", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @event = Event.new(event_params)
        if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 24]]
---
    def destroy
        @event = Event.find(params[:id])
        if @event
            @event.destroy

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "events" SET "description" = $1, "start_date" = $2, "end_date" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["description", "edit test"], ["start_date", "2020-04-01 13:03:00"], ["end_date", "2020-04-24 14:02:00"], ["updated_at", "2020-04-11 01:20:06.555462"], ["id", 35]]
---
    def update
        @event = Event.find(params[:id])

        if @event && @event.update_attributes(event_params)