app/controllers/api/registrations_controller.rb

INSERT INTO "registrations" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 36], ["event_id", 46], ["created_at", "2020-04-13 20:28:47.760737"], ["updated_at", "2020-04-13 20:28:47.760737"]]
---
    def create
        @registration = Registration.new(registration_params)
        @registration.user_id = current_user.id
        @registration.event_id = params[:id]

        if @registration.save

SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "registrations" WHERE "registrations"."id" = $1  [["id", 1]]
---
    def destroy
        @registration = Registration.find(params[:id])
        if @registration && @registration.destroy