app/controllers/api/sessions_controller.rb

    def email
        @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "dog@dogs.com"], ["LIMIT", 1]]