app/views/api/bookmarks/index.json.jbuilder

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1  [["user_id", 36]]
---
json.bookmarks do
    current_user.bookmarks.each do |bookmark|