app/views/api/events/index.json.jbuilder

SELECT "registrations".* FROM "registrations" WHERE "registrations"."event_id" = $1  [["event_id", 45]]
---
    json.registrations do
      event.registrations.each do |registration|

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."event_id" = $1  [["event_id", 45]]
---
    json.bookmarks do
      event.bookmarks.each do |bookmark|