app/views/api/users/show.json.jbuilder

json.registrations do
    @user.registrations.each do |registration|
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."user_id" = $1  [["user_id", 36]]