app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "OO11EmJtyB7x0skI3aX4CA"], ["updated_at", "2020-04-08 02:20:41.852158"], ["id", 12]]
---
    def reset_session_token!
        self.update!(session_token: self.class.generate_session_token)